
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РасходнаяНакладная") Тогда
		// Заполнение шапки
		//Склад = ДанныеЗаполнения.Склад;
		Основание = ДанныеЗаполнения.Ссылка;
		Для Каждого ТекСтрокаСостав Из ДанныеЗаполнения.Состав Цикл
			НоваяСтрока = Состав.Добавить();
			НоваяСтрока.Количество = ТекСтрокаСостав.Количество;
			НоваяСтрока.Номенклатура = ТекСтрокаСостав.Номенклатура;
		КонецЦикла;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим) 
	ГраницаАктуальности = Последовательности.КонтрольАктуальностиСкладскогоУчета.ПолучитьГраницу(Новый Структура("Склад",Склад));
	ГраницаДоукмента    = ЭтотОбъект.МоментВремени();
	Сравнение = Новый СравнениеЗначений;
	РезультаСравнения = Сравнение.Сравнить(ГраницаДоукмента,ГраницаАктуальности);
	
	Если РезультаСравнения>0  Тогда
	 Режим = РежимПроведенияДокумента.Оперативный;	
	КонецЕсли;
	
	
	
	Если Режим = РежимПроведенияДокумента.Оперативный И ПолучаютсяОтрицательныеОстатки() Тогда
	   Отказ = Истина; 
	   Возврат;
	КонецЕсли;
	
	
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр СкладскойУчет Расход
	Движения.СкладскойУчет.Записывать = Истина;
	Для Каждого ТекСтрокаСостав Из Состав Цикл
		Движение = Движения.СкладскойУчет.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаСостав.Номенклатура;
		Движение.Склад = Склад;
		Движение.Количество = ТекСтрокаСостав.Количество;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
Функция ПолучаютсяОтрицательныеОстатки()

	Возврат Отчеты.ОстаткиНоменклатуры.ОбнаруженыМинуса(ЭтотОбъект.Ссылка);

КонецФункции // ПолучаютсяОтрицательныеОстатки()
