Функция ОбнаруженыМинуса(Документ)Экспорт
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СписаниеСостав.Номенклатура КАК Номенклатура,
		|	СУММА(СписаниеСостав.Количество) КАК КоличествоКСписанию,
		|	СписаниеСостав.Ссылка.Склад КАК Склад
		|ПОМЕСТИТЬ ДанныеПоНоменклатуре
		|ИЗ
		|	Документ.Списание.Состав КАК СписаниеСостав
		|ГДЕ
		|	СписаниеСостав.Ссылка = &Документ
		|
		|СГРУППИРОВАТЬ ПО
		|	СписаниеСостав.Номенклатура,
		|	СписаниеСостав.Ссылка.Склад
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДанныеПоНоменклатуре.Номенклатура КАК Номенклатура,
		|	ЕСТЬNULL(СкладскойУчетОстатки.КоличествоОстаток, 0) - ДанныеПоНоменклатуре.КоличествоКСписанию КАК ПрогнозныйОстаток
		|ИЗ
		|	ДанныеПоНоменклатуре КАК ДанныеПоНоменклатуре
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.СкладскойУчет.Остатки(&Период, ) КАК СкладскойУчетОстатки
		|		ПО ДанныеПоНоменклатуре.Номенклатура = СкладскойУчетОстатки.Номенклатура
		|			И ДанныеПоНоменклатуре.Склад = СкладскойУчетОстатки.Склад
		|ГДЕ
		|	ЕСТЬNULL(СкладскойУчетОстатки.КоличествоОстаток, 0) - ДанныеПоНоменклатуре.КоличествоКСписанию < 0";
	
	Запрос.УстановитьПараметр("Документ", Документ);
	Запрос.УстановитьПараметр("Период", Новый Граница (Документ.МоментВремени(),ВидГраницы.Исключая));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой()  Тогда
	    Возврат Ложь;	
	КонецЕсли; 
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	  Сообщить(СтрШаблон("Не хватает номенклатуры: %1 в количестве %2", ВыборкаДетальныеЗаписи.Номенклатура,
	  																	-ВыборкаДетальныеЗаписи.ПрогнозныйОстаток));	
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

     Возврат Истина;

	

КонецФункции // ОбнаруженыМинуса()
