
&НаКлиенте
Процедура ВосстановитьПоследовательность(Команда)
	Попытка
	    ВосстановитьПоследовательностьПоСкладу();
		ЭтотОбъект.СкомпоноватьРезультат(РежимКомпоновкиРезультата.Фоновый);
	Исключение
	 	ПоказатьПредупреждение(,ИнформацияОбОшибке().Причина.Описание);
	КонецПопытки;	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеВариантаНаСервере(Настройки) 
	ЭтотОбъект.Результат.Очистить();
	ЭтотОбъект.Элементы.ФормаВосстановитьПоследовательность.Видимость = ЭтотОбъект.КлючТекущегоВарианта = "АктуальностьУчета";
КонецПроцедуры

// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаКлиенте
Процедура ВосстановитьПоследовательностьПоСкладу() 
	//Настройки = ЭтотОбъект.Отчет.КомпоновщикНастроек.ПолучитьНастройки();
	//ПараметрСклад = Настройки.ПараметрыДанных.Элементы.Найти("Склад"); //
	//
	//Отбор = Новый ТаблицаЗначений;
	//Отбор.Колонки.Добавить("Склад" ,Новый ОписаниеТипов("СправочникСсылка.Склад"));
	//ЭлементыОтбора = Отбор.Добавить();
	//ЭлементыОтбора.Склад = ПараметрСклад.Значение;
	//
	//Последовательности.КонтрольАктуальностиСкладскогоУчета.Восстановить(ТекущаяДатаСеанса(),Отбор);
	//

КонецПроцедуры // ВосстановитьПоследовательностьПоСкладу()
